package day05;
/*
	함수||Method
		함수의 기능
			한가지 작업을 실행하기 위해 만들어진 가장 작은 단위의 프로그램이다.
			(프로그램-함수들과 변수들이 모여서 원하는 목적을 이루도록 구성하는 것.)
			예]
				println() - 어떤 데이터를 문자열로 콘솔에 출력하고 줄바꿈하는 기능
				charAt() - 문자열에서 입력되는 위치값에 해당하는 문자를 반환해주는 기능을 가진 함수
		참고]
			1. 함수는 누군가 호출을 해야 실행된다.
			2. 매개변수 리스트
				==> 변수 선언 형태로 만드는것
					함수를 실행할 때 반드시 필요한 데이터가 있는 경우
					그 데이터를 입력해줘야 함수가 제 기능을 발휘할 것이다.
					이때 입력해주는 데이터를 변수 선언형태로 기술해놓고
					함수 실행부 내에서 그 변수를 받아서 사용하는것.
					갯수의 한계는 없고, [,]로 구분하여 사용한다.
			3. 반환값 타입
			 	==> 함수는 한가지 목적을 달성하기 위한 가장 작은 단위의 프로그램이다.
			 	  ==> 함수를 실행한다는 것은 그 목적이 달성 되어야 한다는 이야기이다.
			 	  	  그러면 그 달성된 목적이 경우에 따라서 결과가 존재해야 한다.
		*************************
		Overloading 규칙
			1. 함수의 이름을 같게 한다.
			2. 매개변수 리스트를 다르게 한다.
			3. 반환값하고는 전혀 상관없다.
 */
public class Test02 {

	public Test02() {
	}
	public static void main(String[] args) {
		System.out.println();
	}
}
